In [1]:
import numpy as np
import pandas as pd

In [9]:
first_data=pd.DataFrame([[1,2,3,4],[1,2,3,4],[5,46,75,32],[23,54,23,21]],columns=['a','b','c','d'])

In [10]:
first_data

    a   b   c   d
0   1   2   3   4
1   1   2   3   4
2   5  46  75  32
3  23  54  23  21

In [11]:
first_data.head(2
)

   a  b  c  d
0  1  2  3  4
1  1  2  3  4

In [6]:
first_data.tail(2
               )

    0   1   2   3
2   5  46  75  32
3  23  54  23  21